Ran Plan for project: `vpc/tmcd_apnortheast2` dir: `terraform/vpc/tmcd_apnortheast2` workspace: `default`

<details><summary>Show Output</summary>

```diff

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # aws_route_table.private[0] has changed
~ resource "aws_route_table" "private" {
        id               = "rtb-03ba155392d51b086"
      ~ route            = [
          - {
              - carrier_gateway_id         = ""
              - cidr_block                 = "0.0.0.0/0"
              - core_network_arn           = ""
              - destination_prefix_list_id = ""
              - egress_only_gateway_id     = ""
              - gateway_id                 = ""
              - ipv6_cidr_block            = ""
              - local_gateway_id           = ""
              - nat_gateway_id             = "nat-0557be3c5291b7b0d"
              - network_interface_id       = ""
              - transit_gateway_id         = ""
              - vpc_endpoint_id            = ""
              - vpc_peering_connection_id  = ""
            },
        ]
        tags             = {
            "Name" = "private0rt-tmcd_apnortheast2"
        }
        # (5 unchanged attributes hidden)
    }

  # aws_route_table.private[1] has changed
~ resource "aws_route_table" "private" {
        id               = "rtb-0b2e7b380745ae868"
      ~ route            = [
          - {
              - carrier_gateway_id         = ""
              - cidr_block                 = "0.0.0.0/0"
              - core_network_arn           = ""
              - destination_prefix_list_id = ""
              - egress_only_gateway_id     = ""
              - gateway_id                 = ""
              - ipv6_cidr_block            = ""
              - local_gateway_id           = ""
              - nat_gateway_id             = "nat-0a25225f2a1b6c742"
              - network_interface_id       = ""
              - transit_gateway_id         = ""
              - vpc_endpoint_id            = ""
              - vpc_peering_connection_id  = ""
            },
        ]
        tags             = {
            "Name" = "private1rt-tmcd_apnortheast2"
        }
        # (5 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_eip.nat[0] will be created
+ resource "aws_eip" "nat" {
      + allocation_id        = (known after apply)
      + arn                  = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = "vpc"
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + ptr_record           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags_all             = (known after apply)
      + vpc                  = (known after apply)
    }

  # aws_eip.nat[1] will be created
+ resource "aws_eip" "nat" {
      + allocation_id        = (known after apply)
      + arn                  = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = "vpc"
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + ptr_record           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags_all             = (known after apply)
      + vpc                  = (known after apply)
    }

  # aws_internet_gateway.default will be created
+ resource "aws_internet_gateway" "default" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name" = "igw-tmcd_apnortheast2"
        }
      + tags_all = {
          + "Name" = "igw-tmcd_apnortheast2"
        }
      + vpc_id   = (known after apply)
    }

  # aws_nat_gateway.nat[0] will be created
+ resource "aws_nat_gateway" "nat" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = (known after apply)
      + tags                               = {
          + "Name" = "NAT-GW0-tmcd_apnortheast2"
        }
      + tags_all                           = {
          + "Name" = "NAT-GW0-tmcd_apnortheast2"
        }
    }

  # aws_nat_gateway.nat[1] will be created
+ resource "aws_nat_gateway" "nat" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = (known after apply)
      + tags                               = {
          + "Name" = "NAT-GW1-tmcd_apnortheast2"
        }
      + tags_all                           = {
          + "Name" = "NAT-GW1-tmcd_apnortheast2"
        }
    }

  # aws_route.private_nat[0] will be created
+ resource "aws_route" "private_nat" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # aws_route.private_nat[1] will be created
+ resource "aws_route" "private_nat" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # aws_route.public_internet_gateway will be created
+ resource "aws_route" "public_internet_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # aws_route53_zone.internal will be updated in-place
~ resource "aws_route53_zone" "internal" {
        id                  = "Z0649378XRN43KJ4TSBI"
        name                = "tmc.internal"
        tags                = {}
        # (7 unchanged attributes hidden)

      - vpc {
          - vpc_id     = "vpc-08519e90b0081bea2" -> null
          - vpc_region = "ap-northeast-2" -> null
        }
      + vpc {
          + vpc_id     = (known after apply)
          + vpc_region = (known after apply)
        }
    }

  # aws_route_table.private[0] must be replaced
-/+ resource "aws_route_table" "private" {
      ~ arn              = "arn:aws:ec2:ap-northeast-2:066346343248:route-table/rtb-03ba155392d51b086" -> (known after apply)
      ~ id               = "rtb-03ba155392d51b086" -> (known after apply)
      ~ owner_id         = "066346343248" -> (known after apply)
      ~ propagating_vgws = [] -> (known after apply)
      ~ route            = [] -> (known after apply)
        tags             = {
            "Name" = "private0rt-tmcd_apnortheast2"
        }
      ~ vpc_id           = "vpc-08519e90b0081bea2" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # aws_route_table.private[1] must be replaced
-/+ resource "aws_route_table" "private" {
      ~ arn              = "arn:aws:ec2:ap-northeast-2:066346343248:route-table/rtb-0b2e7b380745ae868" -> (known after apply)
      ~ id               = "rtb-0b2e7b380745ae868" -> (known after apply)
      ~ owner_id         = "066346343248" -> (known after apply)
      ~ propagating_vgws = [] -> (known after apply)
      ~ route            = [] -> (known after apply)
        tags             = {
            "Name" = "private1rt-tmcd_apnortheast2"
        }
      ~ vpc_id           = "vpc-08519e90b0081bea2" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # aws_route_table.private_db[0] must be replaced
-/+ resource "aws_route_table" "private_db" {
      ~ arn              = "arn:aws:ec2:ap-northeast-2:066346343248:route-table/rtb-0a20907fce8ca8834" -> (known after apply)
      ~ id               = "rtb-0a20907fce8ca8834" -> (known after apply)
      ~ owner_id         = "066346343248" -> (known after apply)
      ~ propagating_vgws = [] -> (known after apply)
      ~ route            = [] -> (known after apply)
        tags             = {
            "Name" = "privatedb0rt-tmcd_apnortheast2"
        }
      ~ vpc_id           = "vpc-08519e90b0081bea2" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # aws_route_table.private_db[1] must be replaced
-/+ resource "aws_route_table" "private_db" {
      ~ arn              = "arn:aws:ec2:ap-northeast-2:066346343248:route-table/rtb-08ac862a3fc999234" -> (known after apply)
      ~ id               = "rtb-08ac862a3fc999234" -> (known after apply)
      ~ owner_id         = "066346343248" -> (known after apply)
      ~ propagating_vgws = [] -> (known after apply)
      ~ route            = [] -> (known after apply)
        tags             = {
            "Name" = "privatedb1rt-tmcd_apnortheast2"
        }
      ~ vpc_id           = "vpc-08519e90b0081bea2" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # aws_route_table.public must be replaced
-/+ resource "aws_route_table" "public" {
      ~ arn              = "arn:aws:ec2:ap-northeast-2:066346343248:route-table/rtb-0406bcb8adb6355eb" -> (known after apply)
      ~ id               = "rtb-0406bcb8adb6355eb" -> (known after apply)
      ~ owner_id         = "066346343248" -> (known after apply)
      ~ propagating_vgws = [] -> (known after apply)
      ~ route            = [] -> (known after apply)
        tags             = {
            "Name" = "publicrt-tmcd_apnortheast2"
        }
      ~ vpc_id           = "vpc-08519e90b0081bea2" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # aws_route_table_association.private[0] must be replaced
-/+ resource "aws_route_table_association" "private" {
      ~ id             = "rtbassoc-0667dcc9828d5ec6a" -> (known after apply)
      ~ route_table_id = "rtb-03ba155392d51b086" -> (known after apply)
      ~ subnet_id      = "subnet-073ea3c19a0a4fa1a" -> (known after apply) # forces replacement
    }

  # aws_route_table_association.private[1] must be replaced
-/+ resource "aws_route_table_association" "private" {
      ~ id             = "rtbassoc-007b64e317aea88c3" -> (known after apply)
      ~ route_table_id = "rtb-0b2e7b380745ae868" -> (known after apply)
      ~ subnet_id      = "subnet-0cbe888dc36821262" -> (known after apply) # forces replacement
    }

  # aws_route_table_association.private_db[0] must be replaced
-/+ resource "aws_route_table_association" "private_db" {
      ~ id             = "rtbassoc-0d385803014df01e5" -> (known after apply)
      ~ route_table_id = "rtb-0a20907fce8ca8834" -> (known after apply)
      ~ subnet_id      = "subnet-09f7ed0e038400f6f" -> (known after apply) # forces replacement
    }

  # aws_route_table_association.private_db[1] must be replaced
-/+ resource "aws_route_table_association" "private_db" {
      ~ id             = "rtbassoc-00988c9e093df83bb" -> (known after apply)
      ~ route_table_id = "rtb-08ac862a3fc999234" -> (known after apply)
      ~ subnet_id      = "subnet-0ef04c17b82e2828a" -> (known after apply) # forces replacement
    }

  # aws_route_table_association.public[0] must be replaced
-/+ resource "aws_route_table_association" "public" {
      ~ id             = "rtbassoc-0f82bf59543eab652" -> (known after apply)
      ~ route_table_id = "rtb-0406bcb8adb6355eb" -> (known after apply)
      ~ subnet_id      = "subnet-0edf9f3b39d613c3f" -> (known after apply) # forces replacement
    }

  # aws_route_table_association.public[1] must be replaced
-/+ resource "aws_route_table_association" "public" {
      ~ id             = "rtbassoc-06396958ec6fe7ddb" -> (known after apply)
      ~ route_table_id = "rtb-0406bcb8adb6355eb" -> (known after apply)
      ~ subnet_id      = "subnet-04ea8e9cc6b80b679" -> (known after apply) # forces replacement
    }

  # aws_subnet.private[0] must be replaced
-/+ resource "aws_subnet" "private" {
      ~ arn                                            = "arn:aws:ec2:ap-northeast-2:066346343248:subnet/subnet-073ea3c19a0a4fa1a" -> (known after apply)
      ~ availability_zone_id                           = "apne2-az1" -> (known after apply)
      ~ cidr_block                                     = "10.10.80.0/20" -> "10.11.80.0/20" # forces replacement
      - enable_lni_at_device_index                     = 0 -> null
      ~ id                                             = "subnet-073ea3c19a0a4fa1a" -> (known after apply)
      ~ ipv6_cidr_block                                = "2406:da12:909:b450::/64" -> (known after apply)
      ~ ipv6_cidr_block_association_id                 = "subnet-cidr-assoc-009c2d7355bf43d82" -> (known after apply)
      - map_customer_owned_ip_on_launch                = false -> null
      ~ owner_id                                       = "066346343248" -> (known after apply)
      ~ private_dns_hostname_type_on_launch            = "ip-name" -> (known after apply)
        tags                                           = {
            "Name" = "private0-tmcd_apnortheast2"
        }
      ~ vpc_id                                         = "vpc-08519e90b0081bea2" -> (known after apply) # forces replacement
        # (8 unchanged attributes hidden)
    }

  # aws_subnet.private[1] must be replaced
-/+ resource "aws_subnet" "private" {
      ~ arn                                            = "arn:aws:ec2:ap-northeast-2:066346343248:subnet/subnet-0cbe888dc36821262" -> (known after apply)
      ~ availability_zone_id                           = "apne2-az3" -> (known after apply)
      ~ cidr_block                                     = "10.10.96.0/20" -> "10.11.96.0/20" # forces replacement
      - enable_lni_at_device_index                     = 0 -> null
      ~ id                                             = "subnet-0cbe888dc36821262" -> (known after apply)
      ~ ipv6_cidr_block                                = "2406:da12:909:b460::/64" -> (known after apply)
      ~ ipv6_cidr_block_association_id                 = "subnet-cidr-assoc-05631cee22a3a6c09" -> (known after apply)
      - map_customer_owned_ip_on_launch                = false -> null
      ~ owner_id                                       = "066346343248" -> (known after apply)
      ~ private_dns_hostname_type_on_launch            = "ip-name" -> (known after apply)
        tags                                           = {
            "Name" = "private1-tmcd_apnortheast2"
        }
      ~ vpc_id                                         = "vpc-08519e90b0081bea2" -> (known after apply) # forces replacement
        # (8 unchanged attributes hidden)
    }

  # aws_subnet.private_db[0] must be replaced
-/+ resource "aws_subnet" "private_db" {
      ~ arn                                            = "arn:aws:ec2:ap-northeast-2:066346343248:subnet/subnet-09f7ed0e038400f6f" -> (known after apply)
      ~ availability_zone_id                           = "apne2-az1" -> (known after apply)
      ~ cidr_block                                     = "10.10.160.0/20" -> "10.11.160.0/20" # forces replacement
      - enable_lni_at_device_index                     = 0 -> null
      ~ id                                             = "subnet-09f7ed0e038400f6f" -> (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      - map_customer_owned_ip_on_launch                = false -> null
      ~ owner_id                                       = "066346343248" -> (known after apply)
      ~ private_dns_hostname_type_on_launch            = "ip-name" -> (known after apply)
        tags                                           = {
            "Name" = "db-private0-tmcd_apnortheast2"
        }
      ~ vpc_id                                         = "vpc-08519e90b0081bea2" -> (known after apply) # forces replacement
        # (8 unchanged attributes hidden)
    }

  # aws_subnet.private_db[1] must be replaced
-/+ resource "aws_subnet" "private_db" {
      ~ arn                                            = "arn:aws:ec2:ap-northeast-2:066346343248:subnet/subnet-0ef04c17b82e2828a" -> (known after apply)
      ~ availability_zone_id                           = "apne2-az3" -> (known after apply)
      ~ cidr_block                                     = "10.10.176.0/20" -> "10.11.176.0/20" # forces replacement
      - enable_lni_at_device_index                     = 0 -> null
      ~ id                                             = "subnet-0ef04c17b82e2828a" -> (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      - map_customer_owned_ip_on_launch                = false -> null
      ~ owner_id                                       = "066346343248" -> (known after apply)
      ~ private_dns_hostname_type_on_launch            = "ip-name" -> (known after apply)
        tags                                           = {
            "Name" = "db-private1-tmcd_apnortheast2"
        }
      ~ vpc_id                                         = "vpc-08519e90b0081bea2" -> (known after apply) # forces replacement
        # (8 unchanged attributes hidden)
    }

  # aws_subnet.public[0] must be replaced
-/+ resource "aws_subnet" "public" {
      ~ arn                                            = "arn:aws:ec2:ap-northeast-2:066346343248:subnet/subnet-0edf9f3b39d613c3f" -> (known after apply)
      ~ availability_zone_id                           = "apne2-az1" -> (known after apply)
      ~ cidr_block                                     = "10.10.0.0/20" -> "10.11.0.0/20" # forces replacement
      - enable_lni_at_device_index                     = 0 -> null
      ~ id                                             = "subnet-0edf9f3b39d613c3f" -> (known after apply)
      ~ ipv6_cidr_block                                = "2406:da12:909:b400::/64" -> (known after apply)
      ~ ipv6_cidr_block_association_id                 = "subnet-cidr-assoc-03251300e3501cb81" -> (known after apply)
      - map_customer_owned_ip_on_launch                = false -> null
      ~ owner_id                                       = "066346343248" -> (known after apply)
      ~ private_dns_hostname_type_on_launch            = "ip-name" -> (known after apply)
        tags                                           = {
            "Name" = "public0-tmcd_apnortheast2"
        }
      ~ vpc_id                                         = "vpc-08519e90b0081bea2" -> (known after apply) # forces replacement
        # (8 unchanged attributes hidden)
    }

  # aws_subnet.public[1] must be replaced
-/+ resource "aws_subnet" "public" {
      ~ arn                                            = "arn:aws:ec2:ap-northeast-2:066346343248:subnet/subnet-04ea8e9cc6b80b679" -> (known after apply)
      ~ availability_zone_id                           = "apne2-az3" -> (known after apply)
      ~ cidr_block                                     = "10.10.16.0/20" -> "10.11.16.0/20" # forces replacement
      - enable_lni_at_device_index                     = 0 -> null
      ~ id                                             = "subnet-04ea8e9cc6b80b679" -> (known after apply)
      ~ ipv6_cidr_block                                = "2406:da12:909:b410::/64" -> (known after apply)
      ~ ipv6_cidr_block_association_id                 = "subnet-cidr-assoc-0c05dbec58d50f133" -> (known after apply)
      - map_customer_owned_ip_on_launch                = false -> null
      ~ owner_id                                       = "066346343248" -> (known after apply)
      ~ private_dns_hostname_type_on_launch            = "ip-name" -> (known after apply)
        tags                                           = {
            "Name" = "public1-tmcd_apnortheast2"
        }
      ~ vpc_id                                         = "vpc-08519e90b0081bea2" -> (known after apply) # forces replacement
        # (8 unchanged attributes hidden)
    }

  # aws_vpc.default must be replaced
-/+ resource "aws_vpc" "default" {
      ~ arn                                  = "arn:aws:ec2:ap-northeast-2:066346343248:vpc/vpc-08519e90b0081bea2" -> (known after apply)
      ~ cidr_block                           = "10.10.0.0/16" -> "10.11.0.0/16" # forces replacement
      ~ default_network_acl_id               = "acl-0b25851fed106db1b" -> (known after apply)
      ~ default_route_table_id               = "rtb-089d9c9bbda960915" -> (known after apply)
      ~ default_security_group_id            = "sg-09ccb1d3815b1e817" -> (known after apply)
      ~ dhcp_options_id                      = "dopt-0dfff38dce11fd197" -> (known after apply)
      ~ enable_network_address_usage_metrics = false -> (known after apply)
      ~ id                                   = "vpc-08519e90b0081bea2" -> (known after apply)
      ~ ipv6_association_id                  = "vpc-cidr-assoc-086ef732698b0ed74" -> (known after apply)
      ~ ipv6_cidr_block                      = "2406:da12:909:b400::/56" -> (known after apply)
      ~ ipv6_cidr_block_network_border_group = "ap-northeast-2" -> (known after apply)
      - ipv6_netmask_length                  = 0 -> null
      ~ main_route_table_id                  = "rtb-089d9c9bbda960915" -> (known after apply)
      ~ owner_id                             = "066346343248" -> (known after apply)
        tags                                 = {
            "Name" = "vpc-tmcd_apnortheast2"
        }
        # (5 unchanged attributes hidden)
    }

Plan: 26 to add, 1 to change, 18 to destroy.

Changes to Outputs:
~ aws_private_db_cidr_blocks = [
      - "10.10.160.0/20",
      - "10.10.176.0/20",
      + "10.11.160.0/20",
      + "10.11.176.0/20",
    ]
~ cidr_block                 = "10.10.0.0/16" -> "10.11.0.0/16"
~ cidr_numeral               = "10" -> "11"
~ db_private_subnets         = [
      - "subnet-09f7ed0e038400f6f",
      - "subnet-0ef04c17b82e2828a",
      + (known after apply),
      + (known after apply),
    ]
~ private_subnets            = [
      - "subnet-073ea3c19a0a4fa1a",
      - "subnet-0cbe888dc36821262",
      + (known after apply),
      + (known after apply),
    ]
~ public_subnets             = [
      - "subnet-0edf9f3b39d613c3f",
      - "subnet-04ea8e9cc6b80b679",
      + (known after apply),
      + (known after apply),
    ]
~ vpc_id                     = "vpc-08519e90b0081bea2" -> (known after apply)

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p vpc/tmcd_apnortheast2`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis-1257922983.ap-northeast-2.elb.amazonaws.com/lock?id=DevopsArtFactory%252Fterraform-provisioning%252Fterraform%252Fvpc%252Ftmcd_apnortheast2%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p vpc/tmcd_apnortheast2`
</details>
Plan: 26 to add, 1 to change, 18 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
